In [42]:
##Joins

In [29]:
import pandas as pd

# DataFrame 1: Orders
orders = pd.DataFrame({
    'OrderID': [1, 2, 3, 4, 5],
    'CustomerID': [101, 102, 101, 103, 104],
    'OrderDate': ['2025-04-25', '2025-04-26', '2025-04-27', '2025-04-28', '2025-04-29']
})

# DataFrame 2: Customers
customers = pd.DataFrame({
    'CustomerID': [101, 102, 103, 105],
    'CustomerName': ['Alice', 'Bob', 'Charlie', 'David'],
    'City': ['New York', 'London', 'Paris', 'Berlin']
})

print("Orders DataFrame:\n", orders)
print("\nCustomers DataFrame:\n", customers)

Orders DataFrame:
    OrderID  CustomerID   OrderDate
0        1         101  2025-04-25
1        2         102  2025-04-26
2        3         101  2025-04-27
3        4         103  2025-04-28
4        5         104  2025-04-29

Customers DataFrame:
    CustomerID CustomerName      City
0         101        Alice  New York
1         102          Bob    London
2         103      Charlie     Paris
3         105        David    Berlin

In [30]:
df_inner=pd.merge(customers,orders, on='CustomerID', how='inner')

In [31]:
df_inner

   CustomerID CustomerName      City  OrderID   OrderDate
0         101        Alice  New York        1  2025-04-25
1         101        Alice  New York        3  2025-04-27
2         102          Bob    London        2  2025-04-26
3         103      Charlie     Paris        4  2025-04-28

In [32]:
df_left=pd.merge(customers,orders, on='CustomerID', how='left')

In [33]:
df_left

   CustomerID CustomerName      City  OrderID   OrderDate
0         101        Alice  New York      1.0  2025-04-25
1         101        Alice  New York      3.0  2025-04-27
2         102          Bob    London      2.0  2025-04-26
3         103      Charlie     Paris      4.0  2025-04-28
4         105        David    Berlin      NaN         NaN

In [34]:
df_right=pd.merge(customers,orders, on='CustomerID', how='right')

In [35]:
df_right

   CustomerID CustomerName      City  OrderID   OrderDate
0         101        Alice  New York        1  2025-04-25
1         102          Bob    London        2  2025-04-26
2         101        Alice  New York        3  2025-04-27
3         103      Charlie     Paris        4  2025-04-28
4         104          NaN       NaN        5  2025-04-29

In [36]:
df_outer=pd.merge(customers,orders, on='CustomerID', how='outer')

In [37]:
df_outer

   CustomerID CustomerName      City  OrderID   OrderDate
0         101        Alice  New York      1.0  2025-04-25
1         101        Alice  New York      3.0  2025-04-27
2         102          Bob    London      2.0  2025-04-26
3         103      Charlie     Paris      4.0  2025-04-28
4         105        David    Berlin      NaN         NaN
5         104          NaN       NaN      5.0  2025-04-29

In [38]:
# DataFrame 2: Customers
customers2 = pd.DataFrame({
    'Custid': [101, 102, 103, 105],
    'CustomerName': ['Alice', 'Bob', 'Charlie', 'David'],
    'City': ['New York', 'London', 'Paris', 'Berlin']
})

In [40]:
#also if columns have different names
df_with_diff_col_name=pd.merge(customers2,orders, left_on='Custid',right_on='CustomerID', how='left')

In [41]:
df_with_diff_col_name

   Custid CustomerName      City  OrderID  CustomerID   OrderDate
0     101        Alice  New York      1.0       101.0  2025-04-25
1     101        Alice  New York      3.0       101.0  2025-04-27
2     102          Bob    London      2.0       102.0  2025-04-26
3     103      Charlie     Paris      4.0       103.0  2025-04-28
4     105        David    Berlin      NaN         NaN         NaN

In [46]:
#Append and concat DataFrames
# 1. Basic Concatenation (Appending Rows - Vertical)

In [44]:
import pandas as pd

df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})

print("DataFrame 1:\n", df1)
print("\nDataFrame 2:\n", df2)

concatenated_rows = pd.concat([df1, df2])
print("\nConcatenated Rows (Vertical):\n", concatenated_rows)

DataFrame 1:
    A  B
0  1  3
1  2  4

DataFrame 2:
    A  B
0  5  7
1  6  8

Concatenated Rows (Vertical):
    A  B
0  1  3
1  2  4
0  5  7
1  6  8

In [45]:
concatenated_rows_reset = pd.concat([df1, df2]).reset_index(drop=True)
print("\nConcatenated Rows (Vertical) with Reset Index:\n", concatenated_rows_reset)

Concatenated Rows (Vertical) with Reset Index:
    A  B
0  1  3
1  2  4
2  5  7
3  6  8

In [47]:
# 2. Concatenation with Different Columns (Vertical)

In [48]:
df3 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df4 = pd.DataFrame({'A': [5, 6], 'C': [9, 10]})

concatenated_diff_cols = pd.concat([df3, df4])
print("\nConcatenation with Different Columns (Vertical):\n", concatenated_diff_cols)

Concatenation with Different Columns (Vertical):
    A    B     C
0  1  3.0   NaN
1  2  4.0   NaN
0  5  NaN   9.0
1  6  NaN  10.0

In [50]:
# 3. Concatenating Columns (Horizontal)

In [51]:
df5 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]}, index=['row1', 'row2'])
df6 = pd.DataFrame({'C': [5, 6], 'D': [7, 8]}, index=['row1', 'row2'])

print("\nDataFrame 5:\n", df5)
print("\nDataFrame 6:\n", df6)

concatenated_cols = pd.concat([df5, df6], axis=1)
print("\nConcatenated Columns (Horizontal):\n", concatenated_cols)

DataFrame 5:
       A  B
row1  1  3
row2  2  4

DataFrame 6:
       C  D
row1  5  7
row2  6  8

Concatenated Columns (Horizontal):
       A  B  C  D
row1  1  3  5  7
row2  2  4  6  8

In [54]:
# 4. Ignoring the Index (ignore_index=True)

In [55]:
concatenated_ignore_index = pd.concat([df1, df2], ignore_index=True)
print("\nConcatenation with Ignored Index:\n", concatenated_ignore_index)

Concatenation with Ignored Index:
    A  B
0  1  3
1  2  4
2  5  7
3  6  8